# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask' #install apps over cli
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'

# Install Antigen
brew 'antigen'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'grep'

# Install Binaries
brew 'bat'
brew 'diff-so-fancy'
brew 'fzf'
brew 'git-flow-avh'
brew 'git'
brew 'htop'
brew 'httpie'
brew 'hub' #additional git features
brew 'mackup' #backup all application settings
brew 'mas' #use app store from the cli
brew 'ncdu'
brew 'nvm'
brew 'prettyping'
brew 'thefuck'
brew 'tldr'
brew 'tmux'
brew 'trash' #move items to the trash
brew 'tree' #tree command from windows
brew 'unrar'
brew 'wget'
brew 'wifi-password'
brew 'yarn'

# Development
brew 'php'
brew 'mysql@5.7'
brew 'imagemagick'
brew 'redis'

# Development Apps
cask 'hyper' #terminal app
cask 'postman'
cask 'sequel-pro' #sql client
cask 'sketch'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox-extension-pack'
cask 'virtualbox'
cask 'visual-studio-code'

# Apps
cask '1password' #password manager
cask 'aerial' #screen saver
cask 'alfred'
cask 'caffeine' #toggle sleep timer
cask 'firefox'
cask 'google-chrome'
cask 'google-drive-file-stream'
cask 'imageoptim'
cask 'rocket' #emoji client
cask 'slack'
cask 'spectacle' #window manager for mac
cask 'spotify'
cask 'telegram'
cask 'vlc'

# Quicklook - hitting space in finder
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-fira-code'
cask 'font-hack'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
